---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetProperty
source: html/882230c2-859d-8835-b085-0e029d3d9ceb.htm
---
# AssetProperty Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.